Repository: hoanghonghuy/QuickNoteSticky
Catalog: DevSticky/Resources/Strings.*.resx
Languages: vi

source: OK
vi: Đồng ý

source: Cancel
vi: Hủy

source: Save
vi: Lưu

source: Delete
vi: Xóa

source: Rename
vi: Đổi tên

source: Close
vi: Đóng

source: Settings
vi: Cài đặt

source: Yes
vi: Có

source: No
vi: Không

source: Info
vi: Thông tin

source: Dashboard
vi: Bảng điều khiển

source: + New Note
vi: + Ghi chú mới

# NoteCount
source: {0} note(s)
vi: {0} ghi chú

# NoteCountFiltered
source: {0} note(s) (filtered)
vi: {0} ghi chú (đã lọc)

# NoteCountGrouped
source: {0} note(s) • grouped
vi: {0} ghi chú theo nhóm

source: Manage Groups
vi: Quản lý nhóm

source: Manage Tags
vi: Quản lý thẻ

source: Toggle grouped view
vi: Chuyển chế độ xem nhóm

source: Switch to flat view
vi: Chuyển sang xem danh sách

source: Switch to grouped view
vi: Chuyển sang xem theo nhóm

source: (Empty note)
vi: (Ghi chú trống)

source: Untitled Note
vi: Chưa đặt tên

source: Ungrouped
vi: Chưa phân nhóm

source: Click to filter
vi: Nhấn để lọc

source: Add tag
vi: Thêm thẻ

source: Remove tag
vi: Xóa thẻ

# DeleteNoteTitle
source: Delete Note
vi: Xóa ghi chú

# DeleteNoteMessage
source: Are you sure you want to delete this note?
vi: Bạn có chắc muốn xóa ghi chú này?

# DeleteGroupTitle
source: Delete Group
vi: Xóa nhóm

# DeleteGroupMessage
source: Delete group "{0}"?
vi: Xóa nhóm "{0}"?

# DeleteGroupMessageWithNotes
source: Delete group "{0}"? {1} note(s) will be moved to Ungrouped.
vi: Xóa nhóm "{0}"? {1} ghi chú sẽ được chuyển sang Chưa phân nhóm.

# DeleteTagTitle
source: Delete Tag
vi: Xóa thẻ

# DeleteTagMessage
source: Delete tag "{0}"?
vi: Xóa thẻ "{0}"?

# DeleteTagMessageWithNotes
source: Delete tag "{0}"? This tag will be removed from {1} note(s).
vi: Xóa thẻ "{0}"? Thẻ này sẽ bị xóa khỏi {1} ghi chú.

# ManageGroupsTitle
source: Manage Groups
vi: Quản lý nhóm

source: + New Group
vi: + Nhóm mới

# GroupCount
source: {0} group(s)
vi: {0} nhóm

source: Rename Group
vi: Đổi tên nhóm

# DefaultGroupName
source: New Group
vi: Nhóm mới

# ManageTagsTitle
source: Manage Tags
vi: Quản lý thẻ

source: + New Tag
vi: + Thẻ mới

# TagCount
source: {0} tag(s)
vi: {0} thẻ

source: Rename Tag
vi: Đổi tên thẻ

source: Change color
vi: Đổi màu

# DefaultTagName
source: Tag
vi: Thẻ

# NoTagsAvailable
source: No more tags available. Create new tags in Tag Management.
vi: Không còn thẻ nào. Tạo thẻ mới trong Quản lý thẻ.

# SettingsTitle
source: Settings
vi: Cài đặt

source: Default Opacity
vi: Độ trong suốt mặc định

source: Font Size
vi: Cỡ chữ

source: Auto-save Delay
vi: Độ trễ tự động lưu

source: Default Window Size
vi: Kích thước cửa sổ mặc định

source: Default Width
vi: Chiều rộng mặc định

source: Default Height
vi: Chiều cao mặc định

source: Language
vi: Ngôn ngữ

source: Theme
vi: Giao diện

# ThemeLight
source: Light
vi: Sáng

# ThemeDark
source: Dark
vi: Tối

# ThemeSystem
source: System
vi: Theo hệ thống

source: Backup & Restore
vi: Sao lưu và Khôi phục

# ExportData
source: 📤 Export
vi: Xuất dữ liệu

# ImportData
source: 📥 Import
vi: Nhập dữ liệu

# BackupHint
source: Export your notes to a backup file. Import to restore from a previous backup.
vi: Xuất ghi chú ra file sao lưu. Nhập để khôi phục từ bản sao lưu trước.

# ExportSuccess
source: Data exported successfully!
vi: Xuất dữ liệu thành công!

# ExportError
source: Failed to export data.
vi: Không thể xuất dữ liệu.

# ImportSuccess
source: Data imported successfully! Please restart the app.
vi: Nhập dữ liệu thành công! Vui lòng khởi động lại ứng dụng.

# ImportError
source: Failed to import data. The file may be corrupted.
vi: Không thể nhập dữ liệu. File có thể bị hỏng.

# ImportConfirm
source: This will replace all current data. Continue?
vi: Thao tác này sẽ thay thế toàn bộ dữ liệu hiện tại. Tiếp tục?

# ImportConfirmTitle
source: Confirm Import
vi: Xác nhận nhập dữ liệu

source: Success
vi: Thành công

source: Error
vi: Lỗi

# TrayNewNote
source: New Note
vi: Ghi chú mới

# TrayShowAll
source: Show All Notes
vi: Hiện tất cả

# TrayHideAll
source: Hide All Notes
vi: Ẩn tất cả

# TrayDashboard
source: Dashboard
vi: Bảng điều khiển

# TraySettings
source: Settings
vi: Cài đặt

# TrayExit
source: Exit
vi: Thoát

source: Pin
vi: Ghim

source: Unpin
vi: Bỏ ghim

source: Search
vi: Tìm kiếm

# SearchPlaceholder
source: Search...
vi: Tìm kiếm...

source: Next
vi: Tiếp

source: Previous
vi: Trước

source: Format
vi: Định dạng

source: Opacity
vi: Độ trong suốt

# LangPlainText
source: Plain Text
vi: Văn bản

# WelcomeTitle
source: Welcome
vi: Chào mừng

# WelcomeContent
source: // Welcome to DevSticky! // Your developer-friendly sticky notes
vi: // Chào mừng đến với DevSticky!

# HotkeyConflictTitle
source: Hotkey Conflict
vi: Xung đột phím tắt

# HotkeyConflictMessage
source: Could not register hotkey "{0}" ({1}). It may be in use by another application.
vi: Không thể đăng ký phím tắt. Có thể đang được sử dụng bởi ứng dụng khác.

source: Hotkeys
vi: Phím tắt

# NewNoteHotkey
source: New Note
vi: Ghi chú mới

# ToggleVisibilityHotkey
source: Toggle Visibility
vi: Ẩn/Hiện

# QuickCaptureHotkey
source: Quick Capture
vi: Ghi nhanh

# SnippetBrowserHotkey
source: Snippet Browser
vi: Thư viện mã

# HotkeyHint
source: Press a key combination (e.g., Ctrl+Shift+N)
vi: Nhấn tổ hợp phím

# HotkeyAvailable
source: Available
vi: Khả dụng

# HotkeyInUse
source: In use by another application
vi: Đang được sử dụng bởi ứng dụng khác

# ClearHotkey
source: Clear
vi: Xóa

source: Cloud Sync
vi: Đồng bộ đám mây

source: Cloud Provider
vi: Nhà cung cấp

# CloudProviderNone
source: None (Disabled)
vi: Không (Tắt)

# CloudConnect
source: Connect
vi: Kết nối

# CloudDisconnect
source: Disconnect
vi: Ngắt kết nối

# CloudConnecting
source: Connecting...
vi: Đang kết nối...

# CloudStatusDisconnected
source: Not connected
vi: Chưa kết nối

# CloudStatusConnecting
source: Connecting...
vi: Đang kết nối...

# CloudStatusSyncing
source: Syncing...
vi: Đang đồng bộ...

# CloudStatusConnected
source: Connected
vi: Đã kết nối

# CloudStatusConnectedLastSync
source: Connected • Last sync: {0}
vi: Đã kết nối - Đồng bộ lần cuối: {0}

# CloudStatusError
source: Error - Click to retry
vi: Lỗi - Nhấn để thử lại

# CloudConnectSuccess
source: Successfully connected to cloud storage!
vi: Kết nối thành công!

# CloudConnectFailed
source: Failed to connect to cloud storage.
vi: Không thể kết nối.

# CloudSelectProvider
source: Please select a cloud provider first.
vi: Vui lòng chọn nhà cung cấp đám mây trước.

# CloudSyncNotAvailable
source: Cloud sync service not available
vi: Dịch vụ đồng bộ đám mây không khả dụng

source: Encryption Passphrase
vi: Mật khẩu mã hóa

# EncryptionHint
source: Your notes will be encrypted before uploading. Keep this passphrase safe - it cannot be recovered!
vi: Ghi chú sẽ được mã hóa trước khi tải lên.

source: Show password
vi: Hiện mật khẩu

# PassphraseLength
source: Passphrase length: {0} characters
vi: Độ dài mật khẩu: {0} ký tự

source: Sync Interval
vi: Khoảng thời gian đồng bộ

source: minutes
vi: phút

source: Sync Now
vi: Đồng bộ ngay

# LastSyncTime
source: Last sync: {0}
vi: Đồng bộ lần cuối: {0}

source: Never synced
vi: Chưa đồng bộ

source: Snippet Library
vi: Thư viện mã

# SnippetLibraryNotAvailable
source: Snippet library is not available.
vi: Thư viện mã không khả dụng.

source: Template Management
vi: Quản lý mẫu

# TemplateManagementNotAvailable
source: Template management is not available.
vi: Quản lý mẫu không khả dụng.

source: Graph View
vi: Xem đồ thị

# GraphViewNotAvailable
source: Graph view is not available.
vi: Xem đồ thị không khả dụng.

# SnippetBrowserTitle
source: Snippet Library
vi: Thư viện mã

source: Search snippets...
vi: Tìm kiếm mã...

source: All Categories
vi: Tất cả danh mục

source: No snippets found
vi: Không tìm thấy mã

# SnippetPreview
source: Preview
vi: Xem trước

# InsertSnippet
source: Insert
vi: Chèn

# EditSnippet
source: Edit
vi: Sửa

# DeleteSnippet
source: Delete
vi: Xóa

# ExportSnippets
source: Export
vi: Xuất

# ImportSnippets
source: Import
vi: Nhập

# SnippetName
source: Name
vi: Tên

# SnippetDescription
source: Description
vi: Mô tả

# SnippetCategory
source: Category
vi: Danh mục

# SnippetTags
source: Tags
vi: Thẻ

# SnippetContent
source: Content
vi: Nội dung

source: Save Snippet
vi: Lưu mã

# SaveSnippetTitle
source: Save as Snippet
vi: Lưu thành mã

# PlaceholdersDetected
source: Placeholders detected: {0}
vi: Phát hiện placeholder: {0}

# SnippetExportSuccess
source: Snippets exported successfully!
vi: Xuất mã thành công!

# SnippetImportSuccess
source: Snippets imported successfully!
vi: Nhập mã thành công!

# SnippetImportConflict
source: Import Conflict
vi: Xung đột nhập

# SnippetImportConflictMessage
source: Some snippets already exist. How would you like to handle conflicts?
vi: Một số mã đã tồn tại. Bạn muốn xử lý xung đột như thế nào?

source: Skip existing
vi: Bỏ qua

source: Replace existing
vi: Thay thế

source: Keep both
vi: Giữ cả hai

# TemplateSelectionTitle
source: Select Template
vi: Chọn mẫu

source: Blank Note
vi: Ghi chú trống

# BlankNoteDescription
source: Start with an empty note
vi: Bắt đầu với ghi chú trống

source: Built-in Templates
vi: Mẫu có sẵn

# UserTemplates
source: My Templates
vi: Mẫu của tôi

source: Create Template
vi: Tạo mẫu

source: Edit Template
vi: Sửa mẫu

source: Delete Template
vi: Xóa mẫu

source: Export Templates
vi: Xuất mẫu

source: Import Templates
vi: Nhập mẫu

# TemplateExportSuccess
source: Templates exported successfully!
vi: Xuất mẫu thành công!

# TemplateImportSuccess
source: Templates imported successfully!
vi: Nhập mẫu thành công!

source: Save as Template
vi: Lưu làm mẫu

# SaveAsTemplateTitle
source: Save Note as Template
vi: Lưu ghi chú làm mẫu

source: Template Name
vi: Tên mẫu

# TemplateDescription
source: Description
vi: Mô tả

# TemplateCategory
source: Category
vi: Danh mục

# CannotDeleteBuiltIn
source: Built-in templates cannot be deleted.
vi: Không thể xóa mẫu có sẵn.

# GraphViewTitle
source: Note Graph
vi: Đồ thị ghi chú

# GraphViewEmpty
source: No linked notes found
vi: Không tìm thấy ghi chú liên kết

# GraphViewHint
source: Click a node to open the note. Scroll to zoom, drag to pan.
vi: Nhấn vào nút để mở ghi chú. Cuộn để zoom, kéo để di chuyển.

# GraphNodeLinks
source: {0} links
vi: {0} liên kết

# GraphNodeBacklinks
source: {0} backlinks
vi: {0} liên kết ngược

source: Show Backlinks
vi: Hiện liên kết ngược

# BacklinksTitle
source: Backlinks
vi: Liên kết ngược

# NoBacklinks
source: No notes link to this note
vi: Không có ghi chú nào liên kết đến ghi chú này

# BrokenLink
source: Broken link (note deleted)
vi: Liên kết hỏng (ghi chú đã xóa)

source: Link to note
vi: Liên kết đến ghi chú

# MarkdownPreview
source: Preview
vi: Xem trước

source: Toggle Preview
vi: Bật/tắt xem trước

source: Export as HTML
vi: Xuất HTML

source: Export as PDF
vi: Xuất PDF

source: Export as Markdown
vi: Xuất Markdown

# ExportMarkdownSuccess
source: Markdown exported successfully!
vi: Xuất Markdown thành công!

source: Move to Monitor
vi: Di chuyển đến màn hình

# PrimaryMonitor
source: Primary
vi: Chính

# MonitorUnavailable
source: Note moved to primary monitor (original monitor unavailable)
vi: Ghi chú đã chuyển sang màn hình chính (màn hình gốc không khả dụng)

# SyncConflictTitle
source: Sync Conflict
vi: Xung đột đồng bộ

# SyncConflictMessage
source: This note was modified on another device. How would you like to resolve the conflict?
vi: Ghi chú này đã được sửa đổi trên thiết bị khác. Bạn muốn giải quyết xung đột như thế nào?

# KeepLocal
source: Keep Local Version
vi: Giữ bản địa

# KeepRemote
source: Keep Remote Version
vi: Giữ bản từ xa

# MergeVersions
source: Merge Both Versions
vi: Gộp cả hai

source: Local Version
vi: Bản địa

source: Remote Version
vi: Bản từ xa

# LastModified
source: Last modified: {0}
vi: Sửa đổi lần cuối: {0}

source: Minimize
vi: Thu nhỏ

source: Maximize
vi: Phóng to

source: Zoom In
vi: Phóng to

source: Zoom Out
vi: Thu nhỏ

source: Reset View
vi: Đặt lại

source: Refresh Graph
vi: Làm mới đồ thị

source: Export
vi: Xuất

source: Import
vi: Nhập

source: Insert
vi: Chèn

source: Use Template
vi: Dùng mẫu

source: Save Template
vi: Lưu mẫu

source: Hide Backlinks
vi: Ẩn liên kết ngược

source: Open Graph View
vi: Mở đồ thị

source: Merge Both
vi: Gộp cả hai

source: Select a snippet
vi: Chọn một đoạn mã

source: No template selected
vi: Chưa chọn mẫu

source: Loading preview...
vi: Đang tải xem trước...

source: Preview unavailable
vi: Không thể xem trước

source: WebView2 not available
vi: WebView2 không khả dụng

source: Loading graph...
vi: Đang tải đồ thị...

source: Building graph...
vi: Đang xây dựng đồ thị...

source: Link service not available
vi: Dịch vụ liên kết không khả dụng

source: No notes to display
vi: Không có ghi chú để hiển thị

source: Sync Conflict Detected
vi: Phát hiện xung đột đồng bộ

source: Placeholders:
vi: Placeholder:

source: Detected Placeholders:
vi: Placeholder phát hiện:

# PlaceholderTip
source: Tip: Use {{date}}, {{datetime}}, or {{author}} for auto-fill placeholders
vi: Mẹo: Dùng {{date}}, {{datetime}}, hoặc {{author}} cho placeholder tự động điền

# NameRequired
source: Name *
vi: Tên *

source: Description
vi: Mô tả

source: Tags (comma-separated)
vi: Thẻ (phân cách bằng dấu phẩy)

# TemplateNameRequired
source: Template Name *
vi: Tên mẫu *

source: Default Language
vi: Ngôn ngữ mặc định

source: Category
vi: Danh mục

source: Show Preview
vi: Hiện xem trước

source: Hide Preview
vi: Ẩn xem trước

# DialogTitle
source: Dialog
vi: Hộp thoại

# DashboardTitle
source: DevSticky - Dashboard
vi: DevSticky - Bảng điều khiển

# CloudAuthenticating
source: Authenticating with cloud provider...
vi: Đang xác thực với nhà cung cấp đám mây...

# CloudCheckingRemoteNotes
source: Checking remote notes...
vi: Đang kiểm tra ghi chú từ xa...

# CloudProcessingRemoteNotes
source: Processing remote notes...
vi: Đang xử lý ghi chú từ xa...

# CloudUploadingLocalNotes
source: Uploading local notes...
vi: Đang tải lên ghi chú địa phương...

# CloudSyncComplete
source: Complete
vi: Hoàn tất

# CloudSyncCompletedSuccess
source: Sync completed successfully.
vi: Đồng bộ hoàn tất thành công.

# CloudNotConnected
source: Not connected to cloud provider
vi: Chưa kết nối với nhà cung cấp đám mây

# CloudSyncInProgress
source: Sync already in progress
vi: Đồng bộ đang được thực hiện

# CloudSyncOperationFailed
source: Sync operation failed
vi: Thao tác đồng bộ thất bại

# CloudFailedToSyncNote
source: Failed to sync note
vi: Không thể đồng bộ ghi chú

# ConflictMarkerLocal
source: <<<<<<< LOCAL
vi: <<<<<<< BẢN ĐỊA PHƯƠNG

# ConflictMarkerRemote
source: >>>>>>> REMOTE
vi: >>>>>>> BẢN TỪ XA

# FilterHtmlFiles
source: HTML files (*.html)|*.html|All files (*.*)|*.*
vi: Tệp HTML (*.html)|*.html|Tất cả tệp (*.*)|*.*

# FilterPdfFiles
source: PDF files (*.pdf)|*.pdf|All files (*.*)|*.*
vi: Tệp PDF (*.pdf)|*.pdf|Tất cả tệp (*.*)|*.*

# FilterMarkdownFiles
source: Markdown files (*.md)|*.md|Text files (*.txt)|*.txt|All files (*.*)|*.*
vi: Tệp Markdown (*.md)|*.md|Tệp văn bản (*.txt)|*.txt|Tất cả tệp (*.*)|*.*

source: Export Complete
vi: Xuất hoàn tất

# HtmlExportedTo
source: HTML exported to: {0}
vi: HTML đã được xuất đến: {0}

source: Export Failed
vi: Xuất thất bại

# FailedToExportHtml
source: Failed to export HTML: {0}
vi: Không thể xuất HTML: {0}

source: Export Note
vi: Xuất ghi chú

# PdfExportPlaceholder
source: PDF export is currently a placeholder. This feature will be implemented in a future version.
vi: Xuất PDF hiện đang là tính năng giữ chỗ. Tính năng này sẽ được triển khai trong phiên bản tương lai.

# FailedToExportPdf
source: Failed to export PDF: {0}
vi: Không thể xuất PDF: {0}

# MarkdownExportedTo
source: Markdown exported to: {0}
vi: Markdown đã được xuất đến: {0}

# FailedToExportMarkdown
source: Failed to export Markdown: {0}
vi: Không thể xuất Markdown: {0}

# DefaultExportFileName
source: note
vi: ghi-chu

source: Unpin (on top)
vi: Bỏ ghim (luôn trên cùng)

# PinTooltip
source: Pin
vi: Ghim

# FilterBackupFiles
source: DevSticky Backup (*.devsticky)|*.devsticky|JSON Files (*.json)|*.json
vi: Sao lưu DevSticky (*.devsticky)|*.devsticky|Tệp JSON (*.json)|*.json

# FilterBackupFilesAll
source: DevSticky Backup (*.devsticky)|*.devsticky|JSON Files (*.json)|*.json|All Files (*.*)|*.*
vi: Sao lưu DevSticky (*.devsticky)|*.devsticky|Tệp JSON (*.json)|*.json|Tất cả tệp (*.*)|*.*

# BackupFileNameFormat
source: DevSticky_Backup_{0}
vi: DevSticky_SaoLuu_{0}

# InvalidBackupFormat
source: Invalid backup file format.
vi: Định dạng tệp sao lưu không hợp lệ.

source: Auto Backup
vi: Sao lưu tự động

source: Backup Interval
vi: Khoảng thời gian sao lưu

source: Max Backups
vi: Số bản sao lưu tối đa

source: Backup Now
vi: Sao lưu ngay

source: Restore Backup
vi: Khôi phục

# ManualBackup
source: Manual Export/Import
vi: Xuất/Nhập thủ công

# BackupInProgress
source: Creating backup...
vi: Đang tạo bản sao lưu...

# BackupSuccess
source: Backup created successfully!
vi: Sao lưu thành công!

source: Backup failed
vi: Sao lưu thất bại

source: Backup service not available
vi: Dịch vụ sao lưu không khả dụng

source: Select Backup
vi: Chọn bản sao lưu

source: No backups found
vi: Không tìm thấy bản sao lưu nào

# RestoreConfirmTitle
source: Restore Backup
vi: Khôi phục sao lưu

# RestoreConfirm
source: This will replace all current notes with the backup. Continue?
vi: Thao tác này sẽ thay thế tất cả ghi chú hiện tại bằng bản sao lưu. Tiếp tục?

# RestoreSuccess
source: Backup restored successfully! Please restart the application.
vi: Khôi phục thành công! Vui lòng khởi động lại ứng dụng.

# RestoreFailed
source: Failed to restore backup
vi: Không thể khôi phục bản sao lưu

source: Restore
vi: Khôi phục

# ErrorAppDataNull
source: Deserialized AppData is null
vi: Dữ liệu ứng dụng được giải mã hóa là null
